perf_test/perf_01_debug.txt
====== SET ======
  100000 requests completed in 33.29 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.199 milliseconds (cumulative count 1)
50.000% <= 16.255 milliseconds (cumulative count 50229)
75.000% <= 16.751 milliseconds (cumulative count 75348)
87.500% <= 17.103 milliseconds (cumulative count 87694)
93.750% <= 17.455 milliseconds (cumulative count 93933)
96.875% <= 17.951 milliseconds (cumulative count 96904)
98.438% <= 19.551 milliseconds (cumulative count 98438)
99.219% <= 21.679 milliseconds (cumulative count 99224)
99.609% <= 22.543 milliseconds (cumulative count 99612)
99.805% <= 23.887 milliseconds (cumulative count 99807)
99.902% <= 27.007 milliseconds (cumulative count 99903)
99.951% <= 32.687 milliseconds (cumulative count 99952)
99.976% <= 466.943 milliseconds (cumulative count 99976)
99.988% <= 1967.103 milliseconds (cumulative count 99988)
99.994% <= 3000.319 milliseconds (cumulative count 100000)
100.000% <= 3000.319 milliseconds (cumulative count 100000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.001% <= 0.207 milliseconds (cumulative count 1)
0.005% <= 0.303 milliseconds (cumulative count 5)
0.007% <= 0.407 milliseconds (cumulative count 7)
0.010% <= 0.503 milliseconds (cumulative count 10)
0.015% <= 0.607 milliseconds (cumulative count 15)
0.016% <= 0.703 milliseconds (cumulative count 16)
0.017% <= 0.807 milliseconds (cumulative count 17)
0.018% <= 0.903 milliseconds (cumulative count 18)
0.019% <= 1.103 milliseconds (cumulative count 19)
0.020% <= 1.207 milliseconds (cumulative count 20)
0.022% <= 1.303 milliseconds (cumulative count 22)
0.023% <= 1.407 milliseconds (cumulative count 23)
0.024% <= 1.503 milliseconds (cumulative count 24)
0.025% <= 1.607 milliseconds (cumulative count 25)
0.032% <= 1.703 milliseconds (cumulative count 32)
0.040% <= 1.807 milliseconds (cumulative count 40)
0.049% <= 1.903 milliseconds (cumulative count 49)
0.061% <= 2.007 milliseconds (cumulative count 61)
0.068% <= 2.103 milliseconds (cumulative count 68)
3.028% <= 3.103 milliseconds (cumulative count 3028)
3.123% <= 4.103 milliseconds (cumulative count 3123)
3.581% <= 5.103 milliseconds (cumulative count 3581)
3.726% <= 6.103 milliseconds (cumulative count 3726)
4.226% <= 7.103 milliseconds (cumulative count 4226)
4.463% <= 8.103 milliseconds (cumulative count 4463)
4.685% <= 9.103 milliseconds (cumulative count 4685)
5.860% <= 10.103 milliseconds (cumulative count 5860)
6.703% <= 11.103 milliseconds (cumulative count 6703)
9.485% <= 12.103 milliseconds (cumulative count 9485)
10.137% <= 13.103 milliseconds (cumulative count 10137)
14.438% <= 14.103 milliseconds (cumulative count 14438)
16.293% <= 15.103 milliseconds (cumulative count 16293)
41.518% <= 16.103 milliseconds (cumulative count 41518)
87.694% <= 17.103 milliseconds (cumulative count 87694)
97.285% <= 18.111 milliseconds (cumulative count 97285)
98.304% <= 19.103 milliseconds (cumulative count 98304)
98.548% <= 20.111 milliseconds (cumulative count 98548)
98.884% <= 21.103 milliseconds (cumulative count 98884)
99.451% <= 22.111 milliseconds (cumulative count 99451)
99.739% <= 23.103 milliseconds (cumulative count 99739)
99.822% <= 24.111 milliseconds (cumulative count 99822)
99.853% <= 25.103 milliseconds (cumulative count 99853)
99.882% <= 26.111 milliseconds (cumulative count 99882)
99.904% <= 27.103 milliseconds (cumulative count 99904)
99.922% <= 28.111 milliseconds (cumulative count 99922)
99.932% <= 29.103 milliseconds (cumulative count 99932)
99.935% <= 30.111 milliseconds (cumulative count 99935)
99.940% <= 31.103 milliseconds (cumulative count 99940)
99.947% <= 32.111 milliseconds (cumulative count 99947)
99.955% <= 33.119 milliseconds (cumulative count 99955)
99.958% <= 34.111 milliseconds (cumulative count 99958)
99.962% <= 35.103 milliseconds (cumulative count 99962)
99.963% <= 36.127 milliseconds (cumulative count 99963)
99.964% <= 38.111 milliseconds (cumulative count 99964)
99.965% <= 40.127 milliseconds (cumulative count 99965)
99.968% <= 219.135 milliseconds (cumulative count 99968)
99.971% <= 220.159 milliseconds (cumulative count 99971)
99.974% <= 466.175 milliseconds (cumulative count 99974)
99.977% <= 467.199 milliseconds (cumulative count 99977)
99.978% <= 468.223 milliseconds (cumulative count 99978)
99.979% <= 972.287 milliseconds (cumulative count 99979)
99.981% <= 973.311 milliseconds (cumulative count 99981)
99.982% <= 974.335 milliseconds (cumulative count 99982)
99.985% <= 975.359 milliseconds (cumulative count 99985)
99.987% <= 1966.079 milliseconds (cumulative count 99987)
99.988% <= 1967.103 milliseconds (cumulative count 99988)
99.990% <= 1968.127 milliseconds (cumulative count 99990)
99.991% <= 1969.151 milliseconds (cumulative count 99991)
100.000% <= 3000.319 milliseconds (cumulative count 100000)
100.000% <= 3000.319 milliseconds (cumulative count 100000)

Summary:
  throughput summary: 3004.18 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
       15.996     0.192    16.255    17.567    21.327  3000.319
====== GET ======
  100000 requests completed in 32.19 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  multi-thread: no

Latency by percentile distribution:
0.000% <= 1.343 milliseconds (cumulative count 1)
50.000% <= 15.791 milliseconds (cumulative count 50463)
75.000% <= 16.183 milliseconds (cumulative count 75057)
87.500% <= 16.495 milliseconds (cumulative count 87827)
93.750% <= 16.815 milliseconds (cumulative count 93778)
96.875% <= 17.519 milliseconds (cumulative count 96888)
98.438% <= 19.247 milliseconds (cumulative count 98438)
99.219% <= 21.327 milliseconds (cumulative count 99228)
99.609% <= 22.351 milliseconds (cumulative count 99613)
99.805% <= 25.583 milliseconds (cumulative count 99806)
99.902% <= 29.999 milliseconds (cumulative count 99903)
99.951% <= 37.407 milliseconds (cumulative count 99952)
99.976% <= 442.623 milliseconds (cumulative count 99976)
99.988% <= 1744.895 milliseconds (cumulative count 99988)
99.994% <= 3000.319 milliseconds (cumulative count 100000)
100.000% <= 3000.319 milliseconds (cumulative count 100000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.003% <= 1.407 milliseconds (cumulative count 3)
0.017% <= 1.503 milliseconds (cumulative count 17)
0.033% <= 1.607 milliseconds (cumulative count 33)
0.054% <= 1.703 milliseconds (cumulative count 54)
0.060% <= 1.807 milliseconds (cumulative count 60)
0.079% <= 1.903 milliseconds (cumulative count 79)
0.233% <= 2.007 milliseconds (cumulative count 233)
0.814% <= 2.103 milliseconds (cumulative count 814)
3.162% <= 3.103 milliseconds (cumulative count 3162)
3.194% <= 4.103 milliseconds (cumulative count 3194)
3.786% <= 5.103 milliseconds (cumulative count 3786)
3.929% <= 6.103 milliseconds (cumulative count 3929)
4.476% <= 7.103 milliseconds (cumulative count 4476)
4.906% <= 8.103 milliseconds (cumulative count 4906)
5.785% <= 9.103 milliseconds (cumulative count 5785)
7.067% <= 10.103 milliseconds (cumulative count 7067)
9.133% <= 11.103 milliseconds (cumulative count 9133)
11.838% <= 12.103 milliseconds (cumulative count 11838)
14.378% <= 13.103 milliseconds (cumulative count 14378)
20.341% <= 14.103 milliseconds (cumulative count 20341)
26.459% <= 15.103 milliseconds (cumulative count 26459)
70.576% <= 16.103 milliseconds (cumulative count 70576)
95.728% <= 17.103 milliseconds (cumulative count 95728)
97.707% <= 18.111 milliseconds (cumulative count 97707)
98.373% <= 19.103 milliseconds (cumulative count 98373)
98.667% <= 20.111 milliseconds (cumulative count 98667)
99.075% <= 21.103 milliseconds (cumulative count 99075)
99.579% <= 22.111 milliseconds (cumulative count 99579)
99.672% <= 23.103 milliseconds (cumulative count 99672)
99.726% <= 24.111 milliseconds (cumulative count 99726)
99.787% <= 25.103 milliseconds (cumulative count 99787)
99.825% <= 26.111 milliseconds (cumulative count 99825)
99.861% <= 27.103 milliseconds (cumulative count 99861)
99.885% <= 28.111 milliseconds (cumulative count 99885)
99.893% <= 29.103 milliseconds (cumulative count 99893)
99.903% <= 30.111 milliseconds (cumulative count 99903)
99.906% <= 31.103 milliseconds (cumulative count 99906)
99.914% <= 32.111 milliseconds (cumulative count 99914)
99.915% <= 33.119 milliseconds (cumulative count 99915)
99.918% <= 34.111 milliseconds (cumulative count 99918)
99.927% <= 35.103 milliseconds (cumulative count 99927)
99.928% <= 36.127 milliseconds (cumulative count 99928)
99.935% <= 37.119 milliseconds (cumulative count 99935)
99.956% <= 38.111 milliseconds (cumulative count 99956)
99.961% <= 44.127 milliseconds (cumulative count 99961)
99.962% <= 45.119 milliseconds (cumulative count 99962)
99.964% <= 48.127 milliseconds (cumulative count 99964)
99.966% <= 219.135 milliseconds (cumulative count 99966)
99.968% <= 220.159 milliseconds (cumulative count 99968)
99.969% <= 221.183 milliseconds (cumulative count 99969)
99.970% <= 222.207 milliseconds (cumulative count 99970)
99.971% <= 440.319 milliseconds (cumulative count 99971)
99.973% <= 441.343 milliseconds (cumulative count 99973)
99.974% <= 442.111 milliseconds (cumulative count 99974)
99.976% <= 443.135 milliseconds (cumulative count 99976)
99.977% <= 878.591 milliseconds (cumulative count 99977)
99.978% <= 879.103 milliseconds (cumulative count 99978)
99.980% <= 880.127 milliseconds (cumulative count 99980)
99.982% <= 881.151 milliseconds (cumulative count 99982)
99.985% <= 1743.871 milliseconds (cumulative count 99985)
99.988% <= 1744.895 milliseconds (cumulative count 99988)
100.000% <= 3000.319 milliseconds (cumulative count 100000)
100.000% <= 3000.319 milliseconds (cumulative count 100000)

Summary:
  throughput summary: 3106.27 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
       15.385     1.336    15.791    16.975    20.991  3000.319